Ran Plan for 5 projects:

1. dir: `terraform/01_init_secrets` workspace: `default`
1. dir: `terraform/02_network` workspace: `default`
1. dir: `terraform/04_vault` workspace: `default`
1. dir: `terraform/05_cicd` workspace: `default`
1. dir: `terraform/06_services` workspace: `default`

### 1. dir: `terraform/01_init_secrets` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform1.4.6 plan -input=false -refresh -out \"/atlantis-data/repos/shutthegoatup/homelab/26/default/terraform/01_init_secrets/default.tfplan\"" in "/atlantis-data/repos/shutthegoatup/homelab/26/default/terraform/01_init_secrets": exit status 1
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 1:
│    1: variable "atlantis-github-app" {
│ 
│ The root module input variable "atlantis-github-app" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 5:
│    5: variable "github-webhook-secret" {
│ 
│ The root module input variable "github-webhook-secret" is not set, and has
│ no default value. Use a -var or -var-file command line argument to provide
│ a value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 9:
│    9: variable "arc-github-app" {
│ 
│ The root module input variable "arc-github-app" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 13:
│   13: variable "gsuite" {
│ 
│ The root module input variable "gsuite" is not set, and has no default
│ value. Use a -var or -var-file command line argument to provide a value for
│ this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 17:
│   17: variable "cloudflare" {
│ 
│ The root module input variable "cloudflare" is not set, and has no default
│ value. Use a -var or -var-file command line argument to provide a value for
│ this variable.
╵

```
</details>

---
### 2. dir: `terraform/02_network` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/02_network`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.shutthegoatup.com/lock?id=shutthegoatup%252Fhomelab%252Fterraform%252F02_network%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/02_network`

---
### 3. dir: `terraform/04_vault` workspace: `default`
**Plan Error**
```
running "/usr/local/bin/terraform1.4.6 workspace show" in "/atlantis-data/repos/shutthegoatup/homelab/26/default/terraform/04_vault": chdir /atlantis-data/repos/shutthegoatup/homelab/26/default/terraform/04_vault: no such file or directory

```

---
### 4. dir: `terraform/05_cicd` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.atlantis.data.vault_kv_secret_v2.github will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "vault_kv_secret_v2" "github" {
      + created_time    = (known after apply)
      + custom_metadata = (known after apply)
      + data            = (sensitive value)
      + data_json       = (sensitive value)
      + deletion_time   = (known after apply)
      + destroyed       = (known after apply)
      + id              = (known after apply)
      + mount           = "kvv2"
      + name            = "atlantis-github-app"
      + path            = (known after apply)
    }

  # module.atlantis.helm_release.helm will be updated in-place
~ resource "helm_release" "helm" {
        id                         = "atlantis"
      ~ metadata                   = [
          - {
              - app_version = "v0.24.3"
              - chart       = "atlantis"
              - name        = "atlantis"
              - namespace   = "atlantis"
              - revision    = 2
              - values      = jsonencode(
                    {
                      - defaultTFVersion        = "1.4.6"
                      - enableKubernetesBackend = true
                      - environment             = {
                          - KUBE_IN_CLUSTER_CONFIG = true
                        }
                      - githubApp               = {
                          - id     = 56481
                          - key    = <<-EOT
                                -----BEGIN RSA PRIVATE KEY-----
                                MIIEpQIBAAKCAQEArpayFwL0Sn5piV0TYfBo0VKyXtsAcYor2dIyqVyTS9rBPudh
                                WWUhlq60WKr6UJ5a/VrTtayvsuiAAip0RAEz8hgnlFR0v/DYFheKpsshm7SQl0e8
                                7ZNgk51lIX4Z9Ig7v7FJZkM26rM0j4+SrVhkL6WviIvx1WmtDHyJZEJB6WPWPwg2
                                8mZXZbgh5hjZru9v6zCzb/tyaamW1j2yGLVjlsAdzhF1QwiISUYV2T2tqze0p2vA
                                Iw7s79IVJVNyQOeuspBboq3mV/08h8OxJMEKBws7qitShNzEn8jCm2dFHIRdwYdH
                                HsA7ndGiddyuVbjSL1wAaPlDJqdeYIMK0/Uv4QIDAQABAoIBAQCpk+XXRB9UXATW
                                T3mMH58v8ksep0l+/t4o7GoY5rqLaydYmhWMZxaA7aBun2QS+j0W6SnJxLnD5OCx
                                OdtEUobKF3waLw5XgO/iRWt/Jr62JmRrDFsNx6B+wNqB9aHwSoL+Zo0MryygOwBK
                                kQG/LaPiQ+SDlKqIx+Q1xKEOqOysa5lo7dIFIexcwL150nzUaq2ML5Cugybzbr9R
                                Tv5YoFObLj4+3cALc/qCx7Z8s+gvAsdi5G4Na8NHyOCni8QAyT1XpOV5mmyVwYl4
                                DWl5geNQ0fcU0KHIP96LslcRekSumS5NVy393Hc2X1cXm0TpPbJycEAW9eLnUqaQ
                                j/nWtwEhAoGBAN6YGgkFo9RenPbyk4jlrR2gKkg/ANauG2vnu2XsuxVyiadyzo8T
                                MjD08MGVUOgVQfL7AGbfKO1f0NBTqsEskMr3uv/PSi/bDsIhHaVvUU+o6/CKQ7l1
                                46B5Pjgh6Wfn8kFp0fOFnf5Mt03yHzTaEqU1YVbb8ec0UELSZZHj2+tDAoGBAMjK
                                QmVxhYnB2XYxhKU2XAUM6SdpIzBH3ukjR4TcrUQnW7Z9H5PiOFDeHvvmlONNRPkF
                                M4ZdPk9mxlOFMsN/CTMQkLaXc6VOk/JV06DuXnbC7lOfiS0M6FHSX4v4qnaR+jPd
                                8aMsedN02lDymTrKwHpyxxQ1E3sZ7DzXWLms0lwLAoGAU9QCUg1+slbjVBjsuOyO
                                Mo8D/WtEvJSbHRsLNwpdNmmJL7eL1NQM3eUQ2kaKTqzaxlACybsXJbYk5J/tuYw4
                                B0gec4I0VStxNmjUSl5Ox+o82LypXqnoDKI8bVVQGmJ+mGXqvIRAiOmJSuB5IiVS
                                Skd9HgH86u6Hn3Ku769ZPhMCgYEAnaocatWyOxKpdGK7upMtvJV/uv+WrwGwarbW
                                IOC7eSnCnVAw7ImVGQLhp4FO5hE1mKhZ5ibvl5+nGcwcqV/mVF+skoPoPiSujXqR
                                W+vw5yZ3x9gc+fAJuL4NYraW+9XydqnPZQa2frFiAHAOnBi6/SuFYTuwGViopLmg
                                JOQspjMCgYEAv6eraXkTWbv8gm57x17Jr1K7A0TriVZ/XfHIFpmAg/5qKjKuVSLE
                                E3y/YPGAAyJtqEvdhm7PWB7SLhyJ7Eok8HTnQygvAzV9OYwTHnLatIFyyj+Hy0sk
                                0ajLsBFYddm4ZYprzR8fwTChss0YRLAzCJUHjBOJ3wulK6teU7p1uqI=
                                -----END RSA PRIVATE KEY-----
                            EOT
                          - secret = "a2f60b760d0570ee23910fba3f44889a4f401cf0"
                          - slug   = "stgu-autobot"
                        }
                      - hidePrevPlanComments    = true
                      - ingress                 = {
                          - enabled          = true
                          - host             = "atlantis.shutthegoatup.com"
                          - ingressClassName = "nginx"
                          - path             = "/"
                          - pathType         = "Prefix"
                        }
                      - orgAllowlist            = "github.com/shutthegoatup/*"
                      - service                 = {
                          - type = "ClusterIP"
                        }
                    }
                )
              - version     = "4.13.1"
            },
        ] -> (known after apply)
        name                       = "atlantis"
      ~ values                     = [
          - (sensitive value),
        ] -> (known after apply)
        # (26 unchanged attributes hidden)
    }

  # module.vault-config.vault_jwt_auth_backend.oidc will be updated in-place
~ resource "vault_jwt_auth_backend" "oidc" {
        id                     = "oidc"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ oidc_client_id         = (sensitive value)
      ~ provider_config        = {
          + "fetch_groups"             = "true"
          + "fetch_user_info"          = "true"
          + "groups_recurse_max_depth" = "5"
          + "gsuite_admin_impersonate" = "allan@shutthegoatup.com"
          + "gsuite_service_account"   = (sensitive value)
            # (1 unchanged element hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vault-config.vault_kv_secret_v2.secrets["arc-github-app"] will be updated in-place
~ resource "vault_kv_secret_v2" "secrets" {
        id                  = "kvv2/data/arc-github-app"
        name                = "arc-github-app"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vault-config.vault_kv_secret_v2.secrets["atlantis-github-app"] will be updated in-place
~ resource "vault_kv_secret_v2" "secrets" {
        id                  = "kvv2/data/atlantis-github-app"
        name                = "atlantis-github-app"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vault-config.vault_kv_secret_v2.secrets["cloudflare"] will be updated in-place
~ resource "vault_kv_secret_v2" "secrets" {
        id                  = "kvv2/data/cloudflare"
        name                = "cloudflare"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vault-config.vault_kv_secret_v2.secrets["github-webhook-secret"] will be updated in-place
~ resource "vault_kv_secret_v2" "secrets" {
        id                  = "kvv2/data/github-webhook-secret"
        name                = "github-webhook-secret"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vault-config.vault_kv_secret_v2.secrets["gsuite"] will be updated in-place
~ resource "vault_kv_secret_v2" "secrets" {
        id                  = "kvv2/data/gsuite"
        name                = "gsuite"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vault-secrets-operator.data.kubernetes_config_map_v1.ca will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_config_map_v1" "ca" {
      + binary_data = (known after apply)
      + data        = (known after apply)
      + id          = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "kube-root-ca.crt"
          + namespace        = "kube-public"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.vault-secrets-operator.vault_kubernetes_auth_backend_config.kubernetes will be updated in-place
~ resource "vault_kubernetes_auth_backend_config" "kubernetes" {
        id                     = "auth/kubernetes/config"
      ~ kubernetes_ca_cert     = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIC/jCCAeagAwIBAgIBADANBgkqhkiG9w0BAQsFADAVMRMwEQYDVQQDEwprdWJl
            cm5ldGVzMB4XDTIzMDYzMDEyMzcyOVoXDTMzMDYyNzEyMzcyOVowFTETMBEGA1UE
            AxMKa3ViZXJuZXRlczCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAMEa
            Sbdtu5oSSGUFzCbUjsoZwe72ip+DCy3GAwXD/3idfHusnv9pE3uqxXYX0l5BuXtx
            1/Xm3zzwne7XSlJWaubrKHrzIi8p1smhuPffK47f0lyYwABhX63vCFy7jC2qm/5t
            Xr4TYIdJe45G7qm0yFjaG5hWC9uAwBd2EmGGUEP57PErdMeQ/XUePGOQ242GzQTY
            84fECl6MsKPvZIgOhv1bVtv4U0a52dvPGPQ+6qwG+JEs+HrCIGS2EjhIxP/XJDA+
            l4n7O4QkTC1ueHkOhwyFeSAeN38S52EuecZ559EqvTjDYnidY5RrDmDDLTHuZGYM
            D1lvMXYfLN/l3SI7Uh8CAwEAAaNZMFcwDgYDVR0PAQH/BAQDAgKkMA8GA1UdEwEB
            /wQFMAMBAf8wHQYDVR0OBBYEFNwzaeSUHjNU9+hMb4t6isHewFMeMBUGA1UdEQQO
            MAyCCmt1YmVybmV0ZXMwDQYJKoZIhvcNAQELBQADggEBACabo/l5uGLxcR8B8Z+e
            rSQzMFBGdeUMbjUsmw2Vda4XCjioK4L7tIJXPeN5+wV1YjKPL3r044Gz7xWBS0Qg
            6uwsTnOZIEx68fkfhcwWCkodVCIkyaqBBJhaHKg3rIZUFupqKYtR2eHiWiBJM+RS
            WNUZeEbY2LIpftoxrH6hg7DXUWz/xOrOxMCx6XYyYjpHxg65GndD9zdJ3q1va/A6
            pMtdg6vGKcKIg4ZXZd01qQeTx3RMVfZn+uKnTZ+SCjacXXnDIfC49oBBRiSdMheR
            cITfl/iqwHTRRMq394Lifw99/QfTAcoeIBWXSsoSaDrop65+b9/+53EVm62+Yssw
            8Vc=
            -----END CERTIFICATE-----
        EOT -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 0 to add, 8 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/05_cicd`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.shutthegoatup.com/lock?id=shutthegoatup%252Fhomelab%252Fterraform%252F05_cicd%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/05_cicd`
</details>
Plan: 0 to add, 8 to change, 0 to destroy.

---
### 5. dir: `terraform/06_services` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform1.4.6 plan -input=false -refresh -out \"/atlantis-data/repos/shutthegoatup/homelab/26/default/terraform/06_services/default.tfplan\"" in "/atlantis-data/repos/shutthegoatup/homelab/26/default/terraform/06_services": exit status 1
module.radarr.kubernetes_namespace.ns: Refreshing state... [id=radarr]
module.sonarr.kubernetes_namespace.ns: Refreshing state... [id=sonarr]
module.sabnzbd.kubernetes_namespace.ns: Refreshing state... [id=sabnzbd]
module.backstage.kubernetes_namespace.ns: Refreshing state... [id=backstage]
module.jellyfin.kubernetes_namespace.ns: Refreshing state... [id=jellyfin]
module.downloads.kubernetes_namespace.namespace: Refreshing state... [id=downloads]
module.backstage.helm_release.helm: Refreshing state... [id=backstage]
module.radarr.helm_release.helm: Refreshing state... [id=radarr]
module.downloads.kubernetes_ingress_v1.ingress: Refreshing state... [id=downloads/downloads]
module.downloads.kubernetes_service.service: Refreshing state... [id=downloads/downloads]
module.sonarr.helm_release.helm: Refreshing state... [id=sonarr]
module.sabnzbd.helm_release.helm: Refreshing state... [id=sabnzbd]
module.jellyfin.helm_release.helm: Refreshing state... [id=jellyfin]
module.downloads.kubernetes_deployment.deployment: Refreshing state... [id=downloads/downloads]
╷
│ Error: Failed to write plan file
│ 
│ The plan file could not be written: open
│ /atlantis-data/repos/shutthegoatup/homelab/26/default/terraform/06_services/default.tfplan:
│ no such file or directory.
╵
╷
│ Error: Invalid function argument
│ 
│   on ../modules/radarr/main.tf line 12, in resource "helm_release" "helm":
│   12:   values = [templatefile("${path.module}/values.yaml.tpl", {
│   13:     }
│   14:   )]
│     ├────────────────
│     │ while calling templatefile(path, vars)
│     │ path.module is "../modules/radarr"
│ 
│ Invalid value for "path" parameter: no file exists at
│ "../modules/radarr/values.yaml.tpl"; this function works only with files
│ that are distributed as part of the configuration source code, so if this
│ file will be created by a resource in this configuration you must instead
│ obtain this result from an attribute of that resource.
╵
╷
│ Error: Invalid function argument
│ 
│   on ../modules/sabnzbd/main.tf line 12, in resource "helm_release" "helm":
│   12:   values = [templatefile("${path.module}/values.yaml.tpl", {
│   13:     }
│   14:   )]
│     ├────────────────
│     │ while calling templatefile(path, vars)
│     │ path.module is "../modules/sabnzbd"
│ 
│ Invalid value for "path" parameter: no file exists at
│ "../modules/sabnzbd/values.yaml.tpl"; this function works only with files
│ that are distributed as part of the configuration source code, so if this
│ file will be created by a resource in this configuration you must instead
│ obtain this result from an attribute of that resource.
╵
╷
│ Error: Invalid function argument
│ 
│   on ../modules/sonarr/main.tf line 13, in resource "helm_release" "helm":
│   13:   values = [templatefile("${path.module}/values.yaml.tpl", {
│   14:     }
│   15:   )]
│     ├────────────────
│     │ while calling templatefile(path, vars)
│     │ path.module is "../modules/sonarr"
│ 
│ Invalid value for "path" parameter: no file exists at
│ "../modules/sonarr/values.yaml.tpl"; this function works only with files
│ that are distributed as part of the configuration source code, so if this
│ file will be created by a resource in this configuration you must instead
│ obtain this result from an attribute of that resource.
╵

```
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`